artillery/nginx-artillery-testing.yaml
config:
  target: http://10.111.204.122/
  http:
    # Responses have to be sent within 30 seconds, or an `ETIMEDOUT` error gets raised.
    timeout: 30
  phases:
     - duration: 60
       arrivalCount: 20
       name: Minimum
  plugins:
    ensure: {}
    apdex: 2500
    metrics-by-endpoint: {} 
    expect:
      reportFailuresAsErrors: true
      outputFormat: prettyError    
scenarios:
  - flow:
    - loop:
        - get:
            url: '/'
            headers:
              Range: 'bytes=0-7500000'  # Specify the byte range you want to request
      count: 25