artillery/nginx-artillery-testing.yaml
config:
  target: http://10.100.97.116/
  phases:
     - duration: 60
       arrivalCount: 20
       name: Minimum
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {} 
    expect:
      reportFailuresAsErrors: true
      outputFormat: prettyError    
scenarios:
  - flow:
    - loop:
        - get:
            url: '/'
            headers:
              Range: 'bytes=0-1000000'  # Specify the byte range you want to request
      count: 10