artillery/nginx-artillery-testing.yaml
config:
  target: http://localhost:8080
  phases:
     - duration: 60
       arrivalCount: 30
       name: Minimum
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}     
scenarios:
  - flow:
    - get: 
        url: '/' 
        headers:
          Range: 'bytes=0-999999'  # Specify the byte range you want to request

    - think: 2min