artillery/nginx-artillery-testing.yaml
config:
  target: http://localhost:8080
  phases:
     - duration: 600
       arrivalCount: 50
       name: Minimum
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {} 
    expect:
      reportFailuresAsErrors: true
      outputFormat: prettyError    
scenarios:
  - flow:
    - get: 
        url: '/' 
        headers:
          Range: 'bytes=0-104857599'  # byte range to request 100MB